app/Http/Controllers/Admin/DashboardController.php

select sum(`total_amount`) as aggregate from `orders` where `status` = 'completed' and `payment_status` = 'paid' and date(`created_at`) = '2025-05-28'
select sum(`total_amount`) as aggregate from `orders` where `status` = 'completed' and `payment_status` = 'paid' and `created_at` between '2025-05-21 00:00:00' and '2025-05-21 23:59:59'
select count(*) as aggregate from `users` where date(`created_at`) = '2025-05-28'
---
    public function index()
    {
        // Data pendapatan hari ini
        $pendapatanHariIni = Orders::where('status', 'completed')
            ->where('payment_status', 'paid')
            ->whereDate('created_at', Carbon::today())
            ->sum('total_amount');

        // Data pendapatan minggu lalu untuk perbandingan
        $pendapatanMingguLalu = Orders::where('status', 'completed')
            ->where('payment_status', 'paid')
            ->whereBetween('created_at', [
                Carbon::now()->subWeek()->startOfDay(),
                Carbon::now()->subWeek()->endOfDay()
            ])
            ->sum('total_amount');

        // Persentase perubahan pendapatan
        $persentasePendapatan = $pendapatanMingguLalu > 0
            ? (($pendapatanHariIni - $pendapatanMingguLalu) / $pendapatanMingguLalu) * 100
            : 100;

        // Data pengguna baru 30 hari terakhir
        $penggunaBaru = User::whereBetween('created_at', [
            Carbon::now()->subDays(30)->startOfDay(),
            Carbon::now()->endOfDay()
        ])->count();

select count(*) as aggregate from `orders` where date(`created_at`) = '2025-05-27'
---
            : 100;

        // Data pesanan hari ini
        $pesananHariIni = Orders::whereDate('created_at', Carbon::today())->count();

select sum(`total_amount`) as aggregate from `orders` where `status` = 'completed' and `payment_status` = 'paid' and date(`created_at`) = '2025-05-27'
---
            : 100;

        // Data penjualan total
        $penjualanTotal = Orders::where('status', 'completed')
            ->where('payment_status', 'paid')
            ->sum('total_amount');

select `produk`.*, (select count(*) from `order_items` where `produk`.`id` = `order_items`.`produk_id` and exists (select * from `orders` where `order_items`.`order_id` = `orders`.`id` and `status` = 'completed' and `payment_status` = 'paid')) as `total_terjual` from `produk` order by `total_terjual` desc limit 5
select * from `orders` order by `created_at` desc limit 6
---
            : 100;

        // Data untuk tabel produk terlaris
        $produkTerlaris = Produk::with('kategori')
            ->withCount(['order_items as total_terjual' => function ($query) {
                $query->whereHas('order', function ($q) {
                    $q->where('status', 'completed')
                        ->where('payment_status', 'paid');
                });
            }])
            ->orderByDesc('total_terjual')
            ->limit(5)
            ->get();

        // Data untuk overview pesanan terbaru
        $pesananTerbaru = Orders::with('user')
            ->latest()
            ->limit(6)
            ->get();