app/Http/Controllers/Admin/PenggunaController.php

select * from `users` limit 10 offset 0
select count(*) as aggregate from `users`
---
    public function indexPengguna()
    {
        $pengguna = DB::table('users')
            ->paginate(10)
            ->through(function ($user) {
                $user->photo = Storage::exists('public/' . $user->photo) ? $user->photo : 'user.svg';
                return $user;
            });

select * from `users` where `id` = '2' limit 1
select count(*) as aggregate from `orders` where `user_id` = '2'
select sum(`total_amount`) as aggregate from `orders` where `user_id` = '2' and `status` = 'completed'
select `produk`.`nama_produk`, COUNT(*) as total_beli from `order_items` inner join `orders` on `orders`.`id` = `order_items`.`order_id` inner join `produk` on `produk`.`id` = `order_items`.`produk_id` where `orders`.`user_id` = '2' group by `produk`.`id`, `produk`.`nama_produk` order by `total_beli` desc limit 5
select `vouchers`.*, `orders`.`created_at` as `tanggal_pakai` from `orders` inner join `vouchers` on `vouchers`.`id` = `orders`.`voucher_id` where `orders`.`user_id` = '2' and `orders`.`voucher_id` is not null
select * from `orders` where `user_id` = '2' order by `created_at` desc limit 10
---
    public function showPengguna($id)
    {
        // Ambil data pengguna
        $pengguna = DB::table('users')
            ->where('id', $id)
            ->first();

        if (!$pengguna) {
            abort(404);
        }

        // Ambil jumlah transaksi
        $totalTransaksi = DB::table('orders')
            ->where('user_id', $id)
            ->count();

        // Ambil total pembelian (sum total amount)
        $totalPembelian = DB::table('orders')
            ->where('user_id', $id)
            ->where('status', 'completed')
            ->sum('total_amount');

        // Ambil produk yang paling sering dibeli
        $produkFavorit = DB::table('order_items')
            ->join('orders', 'orders.id', '=', 'order_items.order_id')
            ->join('produk', 'produk.id', '=', 'order_items.produk_id')
            ->where('orders.user_id', $id)
            ->select('produk.nama_produk', DB::raw('COUNT(*) as total_beli'))
            ->groupBy('produk.id', 'produk.nama_produk')
            ->orderByDesc('total_beli')
            ->limit(5)
            ->get();

        // Ambil voucher yang pernah digunakan
        $voucherDigunakan = DB::table('orders')
            ->join('vouchers', 'vouchers.id', '=', 'orders.voucher_id')
            ->where('orders.user_id', $id)
            ->where('orders.voucher_id', '!=', null)
            ->select('vouchers.*', 'orders.created_at as tanggal_pakai')
            ->get();

        // Ambil riwayat transaksi terakhir
        $riwayatTransaksi = DB::table('orders')
            ->where('user_id', $id)
            ->orderByDesc('created_at')
            ->limit(10)
            ->get();